{"pageProps":{"service":{"id":"public-services","title":"Public Services & Community Recycling","description":"Recycle Metal the K&L Way. TRUST US WITH ALL OF YOUR FERROUS AND NON-FERROUS RECYCLING NEEDS. Are you searching for a facility that provides ferrous and non-ferrous metal recycling?","image":"/assets/equipment/in-action.png","details":["Nine locations across East Texas and beyond","Community-focused approach","Educational outreach programs","Municipal partnerships"],"benefits":["We have ferrous and non-ferrous metal recycling facilities in Tyler, Crockett, Mineola, Palestine, Nacogdoches, Jasper and Jacksonville, TX and Great Bend, KS","We accept ferrous and non-ferrous metal items of all sizes","Simply bring them down to one of our facilities, and we'll handle the rest and pay you CASH!"],"icon":"fas fa-wrench","content":"\n      <h3>Recycle Metal the K&L Way</h3>\n      <p class=\"text-center font-bold text-green-600 mb-6\">TRUST US WITH ALL OF YOUR FERROUS AND NON-FERROUS RECYCLING NEEDS</p>\n\n      <p>Are you searching for a facility that provides ferrous and non-ferrous metal recycling? We have ferrous and non-ferrous metal recycling facilities in Tyler, Crockett, Mineola, Palestine, Nacogdoches, Jasper and Jacksonville, TX and Great Bend, KS. We accept ferrous and non-ferrous metal items of all sizes. Simply bring them down to one of our facilities, and we'll handle the rest and pay you CASH!</p>\n\n      <div class=\"bg-green-50 p-6 rounded-lg my-6\">\n        <h4 class=\"font-bold text-green-800 mb-3\">Industrial Services Include:</h4>\n        <ul class=\"text-green-700\">\n          <li>• K&L is the one to call for laydown yard clean outs</li>\n          <li>• Asset recovery/disposal</li>\n          <li>• Frac tank disposal</li>\n          <li>• Pipeline removal and other types of industrial demolition or disposal</li>\n        </ul>\n        <p class=\"mt-4 text-green-700 italic\">Our processes do not require \"HOT WORK\"!</p>\n\n        <div class=\"mt-6 pt-4 border-t border-green-200\">\n          <p class=\"font-bold text-green-800\">K&L is an ISNetworld Member Contractor!</p>\n        </div>\n      </div>\n    "},"slug":"public-services"},"__N_SSG":true}