{"pageProps":{"service":{"id":"roll-off","title":"Roll-Off Container Services","description":"Take Full Advantage of Our Commercial & Industrial Roll-Off Containers. If you have large piles of metal that you need to get rid of, contact us to learn more about our roll-off containers.","image":"/assets/services/roll-off/kl-recycling-roll-off-container-full.jpeg","details":["Multiple container sizes (20–40 yd³)","Flexible rental terms","Weather-resistant construction","Customized delivery and pickup schedules"],"benefits":["We offer roll-off containers for businesses, construction sites, oil fields, manufacturing companies, and more!","Simple process - we deliver, you fill, we pick up","Multiple sizes available for any metal load","Safe and professional hauling services"],"icon":"fas fa-box","content":"\n      <h3>Take Full Advantage of Our Commercial & Industrial Roll-Off Containers</h3>\n      <p>Contact K&L Recycling today to learn more about our scrap metal recycling facilities and mobile services. K&L Recycling has metal recycling facilities in Tyler, Crockett, Mineola, Palestine, Nacogdoches, Jasper and Jacksonville, TX, as well as Great Bend, KS. We also provide mobile car crushing, mobile demolition & scrap metal recycling throughout Texas, Oklahoma, Louisiana, New Mexico, Kansas and Arkansas.</p>\n\n      <p>If you have large piles of metal that you need to get rid of contact us to learn more about our roll-off containers.</p>\n\n      <h4>We offer roll-off containers for:</h4>\n      <ul>\n        <li>Businesses</li>\n        <li>Construction sites</li>\n        <li>Oil fields</li>\n        <li>Manufacturing companies</li>\n        <li>And more!</li>\n      </ul>\n\n      <p>We try to make the process as easy as possible for our clients. All you have to do is contact us to inquire about our roll-off containers services. One of our experienced representatives will get to know your roll-off needs and handle the rest from there. Once your roll-off container is delivered you simply start filling it and contact us to pick it up. We offer roll-off dumpsters in multiple sizes and are able to safely haul away any size metal load!</p>\n    "},"slug":"roll-off"},"__N_SSG":true}